{
  "backend/main.mo": "Defines audit logging, user profiles, access control, ICP controller state, and various security-related queries and mutations for the backend actor.",
  "feature_evidence.json": "Feature evidence report listing features, affected frontend files, components, tests, and confidence levels for ICP Controller and security access updates.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and behavior of multiple frontend components and pages.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Main React app that handles authentication, role gating for App Controller/Security/ICP Controller, profile setup flow, and routing to dashboards or access denied screen.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denial UI showing login prompts, principal copy utility, and ICP connection/controls panels for unauthorized users.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays detailed audit log information including timestamps, severity, action type, and metadata in a dialog view.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user's authentication status, principal ID, and backend connectivity with copy and retry actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Manages external broadcasting settings, allowing users to enable alerts and configure an endpoint URL.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file-based code editor with category selection, unsaved change warnings, apply/reset actions, and file state management.",
  "frontend/src/components/DeploymentPanel.tsx": "Explains deployment steps and links to deploy the app on the Caffeine platform with guidance alerts.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with authentication, role badges, and theme toggle using Internet Identity and role queries.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network status, canister info, and connection health with retry and error alerts.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Manages ICP controller roles, allowing validation, granting, and revoking principals with a table view.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Provides a searchable, category-based catalog of ICP controls with import/export, editing, and reset functions.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders an individual ICP control row with appropriate input components based on control type.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and presents the ICP controls catalog with a summary card and navigation anchor.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "Presents an ICP mainnet deployment guide with prerequisites, warnings, and step-by-step instructions. Uses UI cards, alerts, and icons to structure the content.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal that prompts the user for their name and saves the profile via a mutation hook. Handles form submission, validation, and loading state.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays real-time security alerts from recent logs and flagged users. Highlights critical and warning events from the last five minutes.",
  "frontend/src/components/RootTerminalPanel.tsx": "Implements an interactive terminal UI for executing administrative commands with history, permissions, and command registry lookup. Executes commands via actor context and logs results.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Computes and displays security metrics from logs, including critical events, failed logins, and spikes. Shows alerts and a summary dashboard of recent activity.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Provides superuser tools to export audit logs or flagged users, with JSON download and audit recording. Handles export workflows, error states, and user feedback.",
  "frontend/src/components/TestActionsPanel.tsx": "UI panel for creating and submitting test audit log entries with configurable action types and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Manages user flagging and removal, displaying flagged users and allowing principal ID input actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches the backend actor based on Internet Identity, reinitializing and invalidating queries on identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Performs a lightweight backend connectivity check using the actor and exposes connection status.",
  "frontend/src/hooks/useIcpControls.ts": "Manages ICP control configuration from URL, session storage, and defaults with setters for network, canister ID, and custom controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login handling, identity persistence, and context access for the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, audit entries, and other backend interactions using the actor.",
  "frontend/src/icp-controls/bindings.ts": "Utility functions for getting control definitions, parsing/serializing values, validating input, and generating session storage keys.",
  "frontend/src/icp-controls/registry.ts": "Defines all control categories and control definitions for ICP configuration, serving as the central registry.",
  "frontend/src/icp-controls/types.ts": "Type definitions for control categories, control types, and structures used by the ICP controls registry.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point wiring React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with filters, audit log table, and multiple security and ICP management panels.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Operations dashboard showing ICP connection, auth status, controls, and terminal panels.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the full terminal command registry by combining core commands.",
  "frontend/src/terminal/coreCommands.ts": "Implements core terminal commands including help, clear, and role management with audit logging.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines ICP Controller-safe terminal commands such as help, clear, and profile operations with backend/auth checks and audit logging.",
  "frontend/src/terminal/terminalGuards.ts": "Provides helpers for audit logging, error classification, and backend/auth validation for terminal commands.",
  "frontend/src/terminal/types.ts": "Declares TypeScript interfaces for terminal commands, context, output, and history entries.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages file state for the code editor using localStorage, including loading, saving, applying changes, and detecting unsaved edits.",
  "frontend/src/utils/icpControls.ts": "Utility functions for ICP network/canister configuration defaults, validation, and display helpers.",
  "frontend/src/utils/icpControlsImportExport.ts": "Handles JSON import/export, file download, and validation of ICP Controls configuration objects.",
  "frontend/src/utils/urlParams.ts": "Provides URL and sessionStorage helpers for retrieving, persisting, and cleaning URL parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color tokens, container settings, animations, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Defines the project’s state, planned features, known issues, and existing feature records for expanding security roles and ICP integration."
}