{
  "backend/main.mo": "Defines types and state for audit logging, access control, user roles, graph data structures, and broadcasting settings within a Motoko actor.",
  "feature_evidence.json": "Lists feature evidence records describing UX and React Query behavior changes with associated files, components, tests, and confidence ratings.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing component purpose, UI behavior, hooks, and system interactions.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, light/dark themes, and global element styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app component handling authentication, role checks, conditional dashboards, and global layout with theme and toast providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen for unauthenticated or unauthorized users with login, principal copy, and access‑request guidance plus ICP status panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays a detailed audit log entry with formatted timestamps, action labels, severity indicators, and descriptions inside a dialog.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user's authentication status, principal ID, and backend connection health with options to copy the principal or retry connection.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Provides a UI to configure external security event broadcasting, including enabling the feature and setting an endpoint URL.",
  "frontend/src/components/CodeEditorPanel.tsx": "Implements a multi-file code editor with category switching, unsaved change warnings, and actions to apply or reset file changes.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders toggle buttons allowing users to switch between security and ICP operations dashboards when permitted.",
  "frontend/src/components/DeploymentPanel.tsx": "Presents steps and a link for deploying the app via the Caffeine platform with informational alerts.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A header component handling authentication, theme toggling, role-based view titles, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network, connection, and canister status with retry and error handling features.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Provides UI to grant or revoke ICP Controller roles, including validation, confirmations, and listing existing controllers.",
  "frontend/src/components/IcpControlsCatalog.tsx": "A searchable, category-based catalog for viewing, editing, importing, and exporting ICP control settings.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders an individual ICP control with the correct input type and change handling.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and introduces the ICP Controls catalog with a brief description and link anchor.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel showing prerequisites and step‑by‑step instructions for deploying canisters to the ICP mainnet.",
  "frontend/src/components/InlineLoadingState.tsx": "Small inline component that displays a loading message with an icon.",
  "frontend/src/components/NetworkMapCanvas.tsx": "Canvas-based renderer for network graphs with zooming, panning, theming, and draggable nodes.",
  "frontend/src/components/NetworkMapInspector.tsx": "Inspector panel for viewing and editing a selected node’s properties and managing edges.",
  "frontend/src/components/NetworkMapPanel.tsx": "Main panel managing the network graph view, node creation, updates, deletion, and data fetching.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user’s profile name during initial setup.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays recent security alerts and flagged users with real-time updates and severity indicators.",
  "frontend/src/components/RolesAccessPanel.tsx": "UI panel for viewing caller roles, app controller status, and performing controller initialization or transfer actions.",
  "frontend/src/components/RootTerminalPanel.tsx": "Interactive admin terminal for executing commands, managing history, and logging command outputs using a command registry.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Computes recent security metrics from audit logs and displays alerts and activity summaries.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Tools for superusers to export audit logs, download flagged user data, and record related audit events.",
  "frontend/src/components/TestActionsPanel.tsx": "Form-based interface to create test audit log entries with customizable action types and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "UI panel for flagging, unflagging, and removing users via principal IDs, displaying a table of flagged users.",
  "frontend/src/components/WebControlQuickToolsPanel.tsx": "Client-side tools for exporting, importing, resetting, and validating ICP controller configuration, plus copying the user's principal.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "Interface to grant or revoke World Wide Web Controller roles to principals and list existing controllers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Checks backend availability by calling a lightweight status method and exposes connection state and refetching.",
  "frontend/src/hooks/useDashboardView.ts": "Manages which dashboard view is selected based on access rights and stored session state.",
  "frontend/src/hooks/useIcpControls.ts": "Loads, validates, and updates ICP Controls configuration using URL params, session storage, and defaults, with helpers to modify individual or multiple settings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status flags.",
  "frontend/src/hooks/useMyNodes.ts": "Tracks user-created node IDs per principal using sessionStorage and provides functions to add, remove, clear, and validate stored nodes.",
  "frontend/src/hooks/useNetworkGraph.ts": "Provides React Query hooks for fetching and mutating network graph nodes and edges via the target actor with integrated error handling and toasts.",
  "frontend/src/hooks/useQueries.ts": "Contains misc React Query hooks for fetching and updating user profiles, controller statuses, and other backend-driven metadata tied to the current identity.",
  "frontend/src/hooks/useTargetActor.ts": "Creates and caches an ICP backend actor based on current identity and ICP Controls, initializing access control when authenticated.",
  "frontend/src/icp-controls/bindings.ts": "Defines helpers for reading, validating, parsing, and serializing ICP control values and retrieving control definitions.",
  "frontend/src/icp-controls/registry.ts": "Defines all ICP control categories and control definitions, serving as the registry for configurable ICP settings.",
  "frontend/src/icp-controls/types.ts": "Defines TypeScript types for control categories, control definitions, and options used in the ICP Controls system.",
  "frontend/src/index.css": "Configures Tailwind layers and theme variables with light/dark modes and component-specific style fixes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin security dashboard including audit logs, management panels, and terminal access.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays the ICP operations dashboard with role-based panels, network tools, and a context‑appropriate terminal.",
  "frontend/src/queryKeys.ts": "Provides helper functions generating consistent React Query cache keys.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the core terminal command registry.",
  "frontend/src/terminal/coreCommands.ts": "Implements core terminal commands including help, clear, and security role management with audit logging.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines a restricted command set for ICP Controllers, supporting help, clear, and profile commands with audit recording.",
  "frontend/src/terminal/terminalGuards.ts": "Provides helpers for audit recording, error classification, context validation, timestamp formatting, and parsing backend enum values.",
  "frontend/src/terminal/types.ts": "Defines terminal command, context, output, and history entry interfaces.",
  "frontend/src/terminal/webControlAudit.ts": "Wraps command execution with best‑effort audit logging and consistent error handling for Web Control commands.",
  "frontend/src/terminal/webControlCommandCatalog.ts": "Generates large sets of safe, read‑only Web Control command metadata for diagnostics and operations.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Implements the main command registry, including help, clear, and authenticated Web Control commands.",
  "frontend/src/types/networkGraph.ts": "Defines types for network graphs, including nodes, edges, and input structures for creating and updating them.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages code editor file state in localStorage, including loading, saving, applying, and resetting content.",
  "frontend/src/utils/icpControls.ts": "Provides utilities for determining ICP network defaults, validating canister IDs, and resolving network labels and hosts.",
  "frontend/src/utils/icpControlsImportExport.ts": "Provides functions to export, download, import, validate, and read ICP Controls configuration as JSON.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for retrieving, storing, persisting, and clearing URL or session-based parameters, including hash-based routing handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, animations, container settings, and plugin setup.",
  "project_state.json": "Describes current project state, goals, architecture plans, known issues, and existing features for tracking development progress."
}