{
  "backend/main.mo": "Defines audit logging types, access control state, role models, and controller initialization with various role checks and stored state maps.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing their purpose and role-handling behavior.",
  "frontend/index.css": "Defines Tailwind CSS layers and OKLCH-based color variables for light and dark themes with global element styling.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, role checks, dashboard view selection, and conditional rendering of admin or ICP ops dashboards.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders login or access-denied guidance with principal copy support and embedded ICP connection and control panels for unauthorized users.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays detailed audit log entry information with formatted timestamps, action descriptions, and severity indicators in a dialog.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user's authentication status, principal ID, and backend connectivity with copy and refresh actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Provides UI to view and update external security event broadcasting settings, including enabling/disabling and endpoint URL.",
  "frontend/src/components/CodeEditorPanel.tsx": "Offers an in‑app code editor for backend and frontend files with file switching, change tracking, and apply/reset functionality.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons for switching between allowed dashboard views like security and ICP operations.",
  "frontend/src/components/DeploymentPanel.tsx": "Explains deployment steps and links to deploy the app via the Caffeine platform with guidance alerts.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main app header with authentication controls, role-based titles, theme switching, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network health, canister info, and connection status with retry and error alerts.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Provides UI to list, grant, and revoke ICP controller roles with principal input and confirmation dialogs.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Shows a searchable, categorized list of ICP configuration controls with import/export and reset functionality.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders an individual control row using the appropriate input type and passes value changes upward.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and displays the ICP controls catalog with a header and link to the full configuration section.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI card explaining prerequisites and step‑by‑step instructions for deploying canisters to the ICP mainnet.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter a name and submit it via a profile‑saving mutation.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays recent security alerts and flagged users in real time by filtering logs from the last five minutes.",
  "frontend/src/components/RolesAccessPanel.tsx": "Shows caller and app‑controller principals, handles initialization, and provides copy and role‑related actions.",
  "frontend/src/components/RootTerminalPanel.tsx": "Interactive terminal UI that executes registered commands, tracks history, and records audit entries.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Summarizes recent security events such as critical alerts, failed logins, and unauthorized actions over 24 hours and 7 days.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Provides UI for superusers to export audit logs and flagged user data, recording audit entries for each export action.",
  "frontend/src/components/TestActionsPanel.tsx": "UI for creating and submitting test audit log entries with configurable fields and event types.",
  "frontend/src/components/UserManagementPanel.tsx": "Manages user flagging, unflagging, and removal, displaying flagged users and allowing principal-based operations.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "Manages granting and revoking World Wide Web Controller roles, validating principals and listing current controllers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a lightweight backend connectivity check using the actor and exposes connection status and errors.",
  "frontend/src/hooks/useDashboardView.ts": "Tracks and persists the selected dashboard view based on permissions, allowing switching when permitted.",
  "frontend/src/hooks/useIcpControls.ts": "React hook managing ICP control state via URL, session storage, and defaults, with setters for network, canister, and other registered controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/logout handling using AuthClient, restoring identities on load.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating user profiles, controller statuses, and related backend data.",
  "frontend/src/icp-controls/bindings.ts": "Utility functions for parsing, serializing, validating, and identifying ICP control values and session keys.",
  "frontend/src/icp-controls/registry.ts": "Registry defining all ICP control categories and control metadata including types, defaults, and options.",
  "frontend/src/icp-controls/types.ts": "Type definitions for ICP control categories, control structures, and options.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and base styling.",
  "frontend/src/main.tsx": "Application entry point configuring QueryClient, InternetIdentityProvider, and rendering the root React app.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin security dashboard with panels for connection, auth, roles, controls, alerts, logs, terminal, and deployment tools. Fetches audit logs and passes them to several panels.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays the ICP operations dashboard, selecting terminal configuration based on user roles. Includes connection, auth, roles, controls, and an operations terminal.",
  "frontend/src/queryKeys.ts": "Provides React Query key helpers for controller statuses, lists, and related role-scoped data.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the main terminal command registry composed of core commands.",
  "frontend/src/terminal/coreCommands.ts": "Defines core terminal commands including help, clear, and security role management with audit logging and query invalidation.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines a restricted command set for ICP Controller users, including help, clear, and profile management commands with audit logging.",
  "frontend/src/terminal/terminalGuards.ts": "Implements helpers for audit recording, error classification, backend/auth checks, and parsing utilities for terminal commands.",
  "frontend/src/terminal/types.ts": "Defines TypeScript interfaces for terminal commands, execution context, outputs, and history entries.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Defines allowed commands for World Wide Web Controller users, including help, clear, and a role status check with audit logging.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages code editor state in localStorage, including loading, saving, applying changes, and detecting unsaved edits.",
  "frontend/src/utils/icpControls.ts": "Provides ICP network and canister ID utilities, including defaults, validation, and network labels/hosts.",
  "frontend/src/utils/icpControlsImportExport.ts": "Handles export, download, import, and file-reading of ICP Controls configuration with validation.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "JSON file describing project state, planned features, issues, and architectural decisions."
}