{
  "backend/main.mo": "Defines actor with audit logging types, user and controller role structures, graph node/edge models, and state maps integrating access control.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components and hooks.",
  "frontend/index.css": "Sets Tailwind base styles and OKLCH color variables for light/dark themes with global layout and border rules.",
  "frontend/index.html": "Basic HTML wrapper loading the React app root and main.tsx entry script.",
  "frontend/src/App.tsx": "Main React app handling authentication, role-based access, profile setup, and dashboard view switching with theming.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays login prompt or access‑denied guidance with principal copy support and embedded ICP connection panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Renders a dialog showing detailed audit log information, including timestamps, severity, action type, and descriptions. Provides formatted metadata and UI components for viewing event details.",
  "frontend/src/components/AuthStatusPanel.tsx": "Displays authentication status, principal ID, and backend connectivity state. Includes UI indicators, copy-to-clipboard support, and error alerts.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Allows configuring external broadcasting of security events by toggling enablement and setting an endpoint URL. Loads existing settings and saves updates through backend mutations.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file-based code editor with category switching, unsaved-change prompts, and apply/reset functionality. Loads and persists file state via utility functions.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons to switch between allowed dashboard views such as security and ICP operations. Highlights the selected view and disables switching if not permitted.",
  "frontend/src/components/DeploymentPanel.tsx": "Shows Caffeine platform deployment instructions and provides a link to deploy. Includes informational alerts and outlines required preparation steps.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai. Uses a heart icon and minimal styling.",
  "frontend/src/components/Header.tsx": "Header component handling authentication, theme switching, role-based titles, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Panel showing ICP network, canister ID, and connection status with health checks and retry support.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "UI for listing, granting, and revoking ICP controller roles with validation and confirmation dialogs.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Searchable, category-based catalog for viewing, modifying, importing, and exporting ICP control settings.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders a single ICP control row with input widgets based on its type.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wrapper panel introducing and linking to the ICP controls catalog.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel explaining prerequisites and step‑by‑step instructions for deploying canisters to the ICP mainnet. Provides warnings, links, and structured guidance for advanced deployment workflows.",
  "frontend/src/components/NetworkMapCanvas.tsx": "Canvas component that renders an interactive network graph with panning, zooming, theming, and draggable nodes. Handles drawing nodes, edges, auto-centering, and mouse interaction events.",
  "frontend/src/components/NetworkMapInspector.tsx": "Inspector panel for viewing and editing a selected network node’s properties and connected edges. Supports updating nodes, creating/deleting edges, and read‑only mode.",
  "frontend/src/components/NetworkMapPanel.tsx": "Top-level panel that loads, displays, and manages the interactive network map including node creation, deletion, selection, and graph syncing. Integrates canvas rendering, inspector UI, and user-owned node tracking.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog prompting a new user to enter and save their display name. Submits profile data using a mutation and prevents closing until completion.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays real-time security alerts and flagged users using recent audit logs. Shows critical/warning events from the last five minutes with live status indicators.",
  "frontend/src/components/RolesAccessPanel.tsx": "Displays authenticated user principal, app controller principal, and allows claiming controller role with loading and error states.",
  "frontend/src/components/RootTerminalPanel.tsx": "Implements an admin command terminal with command execution, history tracking, and role-based command access checks.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Computes recent security statistics from audit logs and displays alerts and metrics for critical events and failed logins.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Allows superusers to export audit logs, flagged users, and record related audit events with success/error handling.",
  "frontend/src/components/TestActionsPanel.tsx": "Form interface for creating test audit entries with configurable action types, severity, and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Provides UI to flag, unflag, and remove users by principal ID, displaying and managing a table of flagged users.",
  "frontend/src/components/WebControlQuickToolsPanel.tsx": "Offers client‑side ICP control utilities including copying principal IDs, importing/exporting config, resetting settings, and refreshing the session.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "Allows granting and revoking World Wide Web Controller roles, validating principal IDs and listing existing controllers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a lightweight backend connectivity check using the actor and exposes connection status and retry behavior.",
  "frontend/src/hooks/useDashboardView.ts": "Manages dashboard view selection with session persistence and access‑based view restrictions.",
  "frontend/src/hooks/useIcpControls.ts": "Handles ICP controls configuration with URL/session precedence, validation, and setters for network, canister ID, and control values.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling AuthClient initialization, login flow, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useMyNodes.ts": "Tracks user-associated node IDs in sessionStorage keyed by principal and exposes functions to add, remove, clear, and reconcile tracked nodes.",
  "frontend/src/hooks/useNetworkGraph.ts": "Defines React Query hooks for fetching and mutating network graph nodes and edges using an actor, with error handling and toast notifications.",
  "frontend/src/hooks/useQueries.ts": "Implements various React Query hooks to fetch and mutate user profiles, controller statuses, and security roles via the backend actor.",
  "frontend/src/icp-controls/bindings.ts": "Provides helper functions to retrieve control definitions, parse/serialize control values, validate inputs, and generate storage keys.",
  "frontend/src/icp-controls/registry.ts": "Declares categories and a large registry of ICP control definitions including metadata, types, options, and defaults.",
  "frontend/src/icp-controls/types.ts": "Defines TypeScript types for control categories, control definitions, and category metadata used by the ICP controls registry.",
  "frontend/src/index.css": "Defines Tailwind base layers, color variables for light/dark themes, and component styling overrides including z-index fixes and network canvas styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with security, audit, terminal, deployment, and management panels using audit logs.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays ICP operations dashboard with role-based terminal selection, status panels, network map, and web control tools.",
  "frontend/src/queryKeys.ts": "Exports helper functions that generate consistent React Query keys for status, controllers, and network data.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the full terminal command registry composed of coreCommands.",
  "frontend/src/terminal/coreCommands.ts": "Implements core terminal commands including help, clear, and security role operations with audit logging and query invalidation.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines a restricted command set for ICP Controller users, including help, clear, and profile management commands with backend auth checks.",
  "frontend/src/terminal/terminalGuards.ts": "Provides helpers for audit logging, error classification, timestamp formatting, and parsing audit enum values.",
  "frontend/src/terminal/types.ts": "Defines interfaces for terminal commands, execution context, command output, and history entries.",
  "frontend/src/terminal/webControlAudit.ts": "Wraps command execution with best‑effort audit recording and consistent error handling.",
  "frontend/src/terminal/webControlCommandCatalog.ts": "Generates metadata for hundreds of safe diagnostic and operational terminal commands.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Defines core terminal commands like help and clear and registers Web Controller audit‑wrapped commands.",
  "frontend/src/types/networkGraph.ts": "Declares types for network graph nodes, edges, and input structures for creating or updating them.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages per‑file editor state in localStorage, including loading, saving, diffing, and resetting content.",
  "frontend/src/utils/icpControls.ts": "Provides helpers for detecting ICP network defaults, validating canister IDs, and resolving network labels/hosts.",
  "frontend/src/utils/icpControlsImportExport.ts": "Implements JSON import/export, download, and validation utilities for ICP Controls configuration.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash params, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, and container settings with plugins for typography, container queries, and animation.",
  "project_state.json": "Defines the project's current state, planned architecture, issues, and existing features for managing roles, ICP integration, and admin tools."
}