{
  "backend/main.mo": "Defines core types and state for audit events, access control, controllers, graph data, and broadcasting settings within the main backend canister.",
  "feature_evidence.json": "Lists feature evidence entries describing implemented frontend behavior changes, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files including components, hooks, pages, and utilities.",
  "frontend/index.css": "Defines global Tailwind CSS layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, role checks, conditional dashboards, and profile setup flow.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when users lack access, offering login, role request guidance, principal copy, and ICP connection panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays a detailed view of an audit log entry with formatted timestamps, severity indicators, and descriptive metadata.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user's authentication status, principal ID, and backend connectivity with copy and refresh actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Allows enabling and configuring an external endpoint for broadcasting security events, including validation and saving settings.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file-based code editor with category switching, unsaved-change handling, and applying or resetting modifications.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders a toggle for switching between security and ICP operations dashboard views based on allowed permissions.",
  "frontend/src/components/DeploymentPanel.tsx": "Explains deployment steps and links to the Caffeine platform for publishing the application.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with authentication controls, theme toggle, role-based titles, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network connection status, canister info, and error alerts with retry capability.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Provides UI for listing, granting, and revoking ICP Controller roles, including dialogs and input validation.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Shows a searchable, categorized catalog of ICP controls with import/export, reset, and value editing features.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders a single ICP control row with the appropriate input widget based on control type.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and introduces the ICP Controls catalog with a summary card and navigation anchor.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel explaining ICP mainnet deployment prerequisites and step-by-step instructions.",
  "frontend/src/components/NetworkMapCanvas.tsx": "Canvas component that renders and interacts with a zoomable, draggable network graph with theme-aware styling.",
  "frontend/src/components/NetworkMapInspector.tsx": "Inspector panel for viewing and editing a selected node’s properties and managing its edges.",
  "frontend/src/components/NetworkMapPanel.tsx": "Main network map manager handling fetching, creating, updating, deleting nodes, and coordinating canvas and inspector views.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name on first-time setup.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Panel displaying recent critical or warning security alerts and flagged users in real time.",
  "frontend/src/components/RolesAccessPanel.tsx": "Displays user and app controller principals, handles initialization, and shows loading or error states for role access data.",
  "frontend/src/components/RootTerminalPanel.tsx": "Implements an administrative terminal interface allowing command execution with history, permission checks, and audit logging.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Generates and displays security metrics from audit logs, including failed login spikes, critical events, and recent activity summaries.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Provides superuser tools to export audit logs and flagged user data with audit recording and download utilities.",
  "frontend/src/components/TestActionsPanel.tsx": "UI for creating test audit log entries with configurable action types, severity, and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Provides UI to flag, unflag, and remove users by principal ID, showing a table of flagged users with actions. Uses hooks for backend mutations and input validation.",
  "frontend/src/components/WebControlQuickToolsPanel.tsx": "Offers client‑side tools for copying principal IDs, importing/exporting ICP config, resetting settings, and refreshing the page. Uses ICP controls and Internet Identity hooks.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "UI for granting and revoking World Wide Web Controller roles by principal ID, including validation and listing existing controllers. Integrates with backend role‑management hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, reinitializing on identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Checks backend connectivity by calling a lightweight actor method and exposes connection status with retry logic.",
  "frontend/src/hooks/useDashboardView.ts": "Manages which dashboard view is selected based on user permissions and session state, with controlled switching logic.",
  "frontend/src/hooks/useIcpControls.ts": "Manages ICP Controls config by merging URL, session, and default values, and provides setters and bulk update logic with validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity state, login flow, and AuthClient configuration.",
  "frontend/src/hooks/useMyNodes.ts": "Tracks user-created node IDs per principal using sessionStorage and exposes helpers to add, remove, clear, and validate tracked nodes.",
  "frontend/src/hooks/useNetworkGraph.ts": "Exposes React Query hooks to fetch and mutate network graph nodes and edges using an actor, with validation and toast-based error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks for user profiles, roles, and controller statuses by calling backend actor methods tied to the current identity.",
  "frontend/src/hooks/useTargetActor.ts": "Creates and caches a backend actor based on current identity and ICP Controls, initializing access control when authenticated.",
  "frontend/src/icp-controls/bindings.ts": "Utility functions for ICP control definitions, including lookup, parsing, serialization, validation, and session storage key generation.",
  "frontend/src/icp-controls/registry.ts": "Defines all ICP control categories and control metadata, serving as the centralized registry for configurable application settings.",
  "frontend/src/icp-controls/types.ts": "Defines types for ICP control categories, control definitions, and UI options.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables, plus UI fixes for popovers, tabs, and canvas themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the security admin dashboard with audit logs, management panels, and a terminal.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays ICP operations tools, role‑based panels, network map, and a command terminal.",
  "frontend/src/queryKeys.ts": "Provides shared React Query key generators for caching ICP and security data.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the terminal’s command registry composed from core commands.",
  "frontend/src/terminal/coreCommands.ts": "Implements core terminal commands including help, clear, and security‑related actions with audit logging.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines restricted terminal commands for ICP controller roles, including help, clear, and profile management.",
  "frontend/src/terminal/terminalGuards.ts": "Provides helpers for audit recording, error classification, backend/auth checks, and enum parsing for terminal commands.",
  "frontend/src/terminal/types.ts": "Defines interfaces for terminal commands, execution context, outputs, and history entries.",
  "frontend/src/terminal/webControlAudit.ts": "Wraps command execution with best‑effort audit logging and consistent error handling for Web Control commands.",
  "frontend/src/terminal/webControlCommandCatalog.ts": "Generates metadata for 200+ safe, read‑only diagnostic and operational terminal commands.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Registers core terminal commands like help, clear, and controller status, integrating the generated catalog with audit handling.",
  "frontend/src/types/networkGraph.ts": "Declares types for network graph nodes, edges, and CRUD input structures.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages code editor file state in localStorage, including loading, saving, applying, and detecting unsaved changes.",
  "frontend/src/utils/icpControls.ts": "Provides utilities for ICP network configuration, canister ID validation, and environment‑based defaults.",
  "frontend/src/utils/icpControlsImportExport.ts": "Provides functions to export, download, import, validate, and read ICP Controls configuration JSON files.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL parameters, persist them in sessionStorage, and clean parameters from the URL hash.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Tracks project state, planned architecture changes, known issues, and implemented features for the ICP-integrated security-enhanced app."
}