{
  "backend/main.mo": "Motoko canister implementing audit logging, user profiles, access control, ICP controller state, and various query and update methods for authorization and system initialization.",
  "feature_evidence.json": "Feature evidence report mapping product features to affected frontend files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of key frontend React components, hooks, and pages.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and theme-aware CSS properties for light and dark modes.",
  "frontend/index.html": "Minimal HTML entry point loading the React application through main.tsx.",
  "frontend/src/App.tsx": "Main React app managing authentication, role checks, view switching, initialization, and routing between dashboards or access-denied states.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permissions, offering login, principal display with copy support, and ICP-related diagnostic panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays detailed audit log information including timestamps, action types, severity, and metadata in a scrollable dialog.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user's authentication state, principal ID, and backend connectivity status with copy and refresh actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Manages external broadcasting settings, allowing users to enable alerts and configure an endpoint URL.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file editor with category switching, change tracking, apply/reset actions, and unsaved-change warnings.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons to switch between security and ICP operations dashboards when allowed.",
  "frontend/src/components/DeploymentPanel.tsx": "Guides users through deploying on the Caffeine platform with steps, notes, and a link to start deployment.",
  "frontend/src/components/Footer.tsx": "Displays a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main app header with authentication controls, role‑based titles, theme switching, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network connection status, canister info, and error alerts with a retry option.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Manages ICP controller roles, allowing admins to grant or revoke principals with validation and confirmation.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Provides a searchable, categorized catalog of ICP controls with import/export, edit, and reset functionality.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders a single ICP control input row with dynamic input types based on the control definition.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and displays the ICP Controls catalog with a header and navigation anchor.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel showing prerequisites and step-by-step instructions for deploying canisters to the ICP mainnet.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their display name using a profile mutation hook.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays recent critical or warning audit alerts and flagged users with real-time updates.",
  "frontend/src/components/RootTerminalPanel.tsx": "Admin terminal allowing execution of registered commands, tracking history, and handling permissions and audit logging.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Calculates and displays 24-hour and 7-day security event statistics including critical events and failed logins.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Superuser panel for exporting audit logs and flagged user data with audit recording and status handling.",
  "frontend/src/components/TestActionsPanel.tsx": "UI form for creating and submitting mock audit log entries with configurable action types and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Displays flagged users and provides actions to flag, unflag, and remove users by principal ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a lightweight query on the backend actor to report connection status and errors.",
  "frontend/src/hooks/useDashboardView.ts": "Manages the selected dashboard view with session persistence and validation against allowed roles.",
  "frontend/src/hooks/useIcpControls.ts": "Handles ICP control settings by merging URL, session, and defaults, and provides update functions for network, canister ID, and control values.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login and logout handling, and loads identities from storage.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profile, controller status, security status, and initialization via an ICP actor.",
  "frontend/src/icp-controls/bindings.ts": "Implements lookup, parse/serialize, validation, and session key helpers for ICP control definitions.",
  "frontend/src/icp-controls/registry.ts": "Defines the ICP control categories and a large registry of control definitions for configuration UI.",
  "frontend/src/icp-controls/types.ts": "Contains TypeScript types for ICP control categories, control definitions, and options.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark theme color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with audit log filtering, multiple management panels, and access checks.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays the ICP operations console with connection, auth status, controls, and terminal panels.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the full terminal command registry composed of core commands.",
  "frontend/src/terminal/coreCommands.ts": "Defines core terminal commands like help, clear, and security role management with backend auditing and error handling.",
  "frontend/src/terminal/icpControllerCommands.ts": "Provides a restricted command set for ICP Controller users, including help, clear, and profile management with audit integration.",
  "frontend/src/terminal/terminalGuards.ts": "Implements shared helpers for auditing, error classification, authentication checks, and parsing of timestamps and enums.",
  "frontend/src/terminal/types.ts": "Declares TypeScript interfaces for terminal commands, context, outputs, and history entries.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages localStorage-backed state for editable files, including loading, saving, applying changes, and tracking unsaved edits.",
  "frontend/src/utils/icpControls.ts": "Provides utilities for deriving ICP network defaults, validating canister IDs, and mapping network settings to labels and hosts.",
  "frontend/src/utils/icpControlsImportExport.ts": "Handles exporting, downloading, importing, validating, and reading JSON configurations for ICP Controls.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (query or hash), persist them in sessionStorage, retrieve them with fallback, and clear them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, plugins, and layout settings for the frontend.",
  "project_state.json": "Defines current project state, goals, architectural plans, issues, and tracked features for the security-role and ICP‑integration work."
}