{
  "backend/main.mo": "Defines backend actor with audit logging types, access control mixin, user and controller state maps, and graph-related data structures.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing pre-written summaries for various frontend source files and components.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode styling.",
  "frontend/index.html": "Basic HTML shell loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, role checks, dashboard switching, and global layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when the user lacks access, with login, role guidance, principal copy, and ICP panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays a detailed dialog of an audit log entry with formatted timestamps, severity indicators, and contextual descriptions.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows the user’s authentication status, principal ID, and backend connectivity state with copy and refresh actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Allows configuring external security event broadcasting, including enabling/disabling and setting an endpoint URL.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file-based code editor with category switching, unsaved change handling, and applying or resetting modifications.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons to switch between security and ICP operations dashboard views based on permissions.",
  "frontend/src/components/DeploymentPanel.tsx": "Explains deployment steps and links to the Caffeine platform for publishing the application.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the main header with authentication controls, theme toggle, role-based titles, and optional view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP backend connection status, network details, canister ID, and retry/error handling.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Provides UI to grant and revoke ICP Controller roles, including form inputs, listing controllers, and confirmation dialogs.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Shows a searchable, categorized list of ICP controls with import/export, reset, and update functionality.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders a single ICP control row with the appropriate input widget based on control type.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and introduces the ICP Controls catalog with a header and navigation anchor.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel explaining ICP mainnet deployment, prerequisites, and step-by-step commands for deploying canisters.",
  "frontend/src/components/NetworkMapCanvas.tsx": "Interactive canvas that renders nodes and edges, supports zooming, panning, dragging, and theme-based styling.",
  "frontend/src/components/NetworkMapInspector.tsx": "Inspector panel for viewing and editing a selected node’s label, position, and connected edges with create/delete actions.",
  "frontend/src/components/NetworkMapPanel.tsx": "Main network map controller handling node CRUD, canvas interaction, inspector display, and canister/graph loading logic.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting the user to enter and save their profile name on first setup.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Panel showing recent security alerts and flagged users with live-updating indicators and formatted event data.",
  "frontend/src/components/RolesAccessPanel.tsx": "UI panel showing user and app controller principals, load state, and initialization controls with copy and claim actions.",
  "frontend/src/components/RootTerminalPanel.tsx": "Administrative terminal component that parses commands, executes registry actions, logs output, and manages command history.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Generates security event statistics from audit logs and displays critical counts, failed logins, and recent activity.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Superuser tools for exporting audit logs, exporting flagged users, and recording export actions with audit entries.",
  "frontend/src/components/TestActionsPanel.tsx": "Form interface to create and submit test audit events with configurable fields for action type, severity, and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "UI for flagging, unflagging, and removing users by principal ID, displaying a table of flagged users and associated actions.",
  "frontend/src/components/WebControlQuickToolsPanel.tsx": "Provides client‑side tools for copying principal IDs, importing/exporting ICP Controls config, resetting settings, and refreshing connection.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "Manages granting and revoking World Wide Web Controller roles, with validation and a table of existing controllers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing and invalidating related queries when identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a lightweight backend status check using the target actor and returns connection state and errors.",
  "frontend/src/hooks/useDashboardView.ts": "Tracks and persists the selected dashboard view based on permissions and authentication, allowing controlled view switching.",
  "frontend/src/hooks/useIcpControls.ts": "Manages ICP Controls configuration with URL/session precedence, validation, updates, and state synchronization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity status tracking.",
  "frontend/src/hooks/useMyNodes.ts": "Tracks user-created node IDs per principal using sessionStorage, offering add, remove, clear, and validation helpers.",
  "frontend/src/hooks/useNetworkGraph.ts": "Defines React Query hooks for fetching and mutating network graph nodes and edges via a target actor with error‑handled mutations.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for retrieving and updating user profiles, role statuses, and controller information from the backend.",
  "frontend/src/hooks/useTargetActor.ts": "Creates and manages a backend actor tied to the current identity and ICP Controls, initializing access control when authenticated.",
  "frontend/src/icp-controls/bindings.ts": "Utility helpers for control definitions, including lookup, parsing, serialization, validation, and session key generation.",
  "frontend/src/icp-controls/registry.ts": "Defines all ICP control categories and control metadata, serving as the central registry for configuration options.",
  "frontend/src/icp-controls/types.ts": "Defines TypeScript types for ICP control categories, control definitions, and option metadata.",
  "frontend/src/index.css": "Sets Tailwind layers and theme variables plus UI overrides for dark mode, components, and scroll behavior.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers and mounts the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with security, control, audit, terminal, and management panels.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays the ICP operations dashboard with role‑based terminals, controls, network tools, and access panels.",
  "frontend/src/queryKeys.ts": "Exports helper functions generating consistent React Query cache keys for multiple ICP-related queries.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the terminal command registry populated from coreCommands.",
  "frontend/src/terminal/coreCommands.ts": "Implements core terminal commands including help, clear, and security role operations with audit logging and backend interactions.",
  "frontend/src/terminal/icpControllerCommands.ts": "Defines a restricted set of terminal commands safe for ICP Controllers, including help, clear, and profile management.",
  "frontend/src/terminal/terminalGuards.ts": "Provides audit helpers, error classification, and utility parsers for terminal commands.",
  "frontend/src/terminal/types.ts": "Defines terminal command, context, output, and history interfaces.",
  "frontend/src/terminal/webControlAudit.ts": "Wraps command execution with best‑effort audit logging and consistent error handling.",
  "frontend/src/terminal/webControlCommandCatalog.ts": "Generates large sets of safe, read‑only diagnostic and operational command metadata.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Registers terminal commands including help, clear, status checks, and catalog‑generated commands.",
  "frontend/src/types/networkGraph.ts": "Defines types for nodes, edges, and input structures for editing network graphs.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages file state persistence for the browser code editor using localStorage.",
  "frontend/src/utils/icpControls.ts": "Utility functions for resolving, validating, and labeling ICP network and canister configuration.",
  "frontend/src/utils/icpControlsImportExport.ts": "Provides functions to export, download, import, validate, and read ICP Controls configuration JSON files.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "JSON snapshot describing project goals, architectural plans, issues, and existing feature entries for the ICP-integrated app."
}