{
  "backend/main.mo": "Defines audit event types, role and controller records, access control initialization, and core queries for app controller and initialization logic.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides high‑level summaries of many frontend files including dashboards, panels, hooks, and UI components.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables and theme-aware light/dark mode styles.",
  "frontend/index.html": "HTML entrypoint mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, role checks, dashboard routing, and profile setup flow.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown to unauthorized users with login prompts, principal copy tool, and ICP status panels.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays detailed audit log information including timestamps, action types, severity, and descriptions in a scrollable dialog.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows authentication state, principal ID, and backend connectivity status with copy and refresh actions.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Provides UI to view and configure external security event broadcasting settings, including endpoint URL and enable/disable controls.",
  "frontend/src/components/CodeEditorPanel.tsx": "Implements a file-based code editor with category switching, unsaved-change handling, apply/reset actions, and file state persistence.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons for switching between security and ICP operations dashboard views when allowed.",
  "frontend/src/components/DeploymentPanel.tsx": "Displays instructions and links for deploying the app via the Caffeine platform with guidance and recommended steps.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with authentication controls, role-based titles, theme switching, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network status, canister details, and connection health with retry and error alerts.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Provides UI to grant or revoke ICP controller roles, manage principal inputs, and view existing controllers.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Shows a searchable, categorized list of ICP controls with import/export, reset, and edit functionality.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders an individual ICP control row with appropriate input type based on control definition.",
  "frontend/src/components/IcpControlsPanel.tsx": "Wraps and introduces the ICP controls catalog with a link to the full configuration section.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel showing prerequisites and step‑by‑step instructions for deploying canisters to the ICP mainnet. Includes alerts, badges, and code snippet examples.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a user's name and saves their profile using a mutation. Displays validation and loading states during submission.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays recent security alerts and flagged users with live updates filtered from audit logs. Shows alert counts, timestamps, and severity‑based styling.",
  "frontend/src/components/RolesAccessPanel.tsx": "Panel for viewing principals, checking app controller status, and initializing or copying role‑related identities. Handles loading, errors, and role‑based UI states.",
  "frontend/src/components/RootTerminalPanel.tsx": "Interactive terminal interface that executes registered commands with context from actor and identity, maintaining history and handling errors. Supports command execution, privilege checks, and scroll management.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Computes and displays security event statistics from audit logs, including critical events, failed logins, and spikes. Provides alerts and a summary card with recent activity metrics.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Provides superuser tools to export audit logs, export flagged users, and record audit actions with JSON download helpers.",
  "frontend/src/components/TestActionsPanel.tsx": "UI for manually creating test audit log entries with selectable action types and metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Manages user flagging, unflagging, and removal, displaying flagged users and validating principal IDs.",
  "frontend/src/components/WebControlQuickToolsPanel.tsx": "Client-side tools for exporting, importing, and resetting configuration plus copying the current principal.",
  "frontend/src/components/WorldWideWebControllerManagementPanel.tsx": "Lets admins grant or revoke World Wide Web Controller roles and view current controllers with principal validation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing on identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Checks backend availability by calling a lightweight status method and exposes connectivity state.",
  "frontend/src/hooks/useDashboardView.ts": "Manages dashboard view selection based on auth state, access permissions, and sessionStorage persistence.",
  "frontend/src/hooks/useIcpControls.ts": "Builds and manages ICP control configuration from URL, sessionStorage, and defaults, with setters and validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading persisted identities and managing login/logout state.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for profiles, controller statuses, and related mutations.",
  "frontend/src/icp-controls/bindings.ts": "Defines helpers for parsing, serializing, validating, and session-keying ICP control values.",
  "frontend/src/icp-controls/registry.ts": "Defines all ICP control categories and control metadata used by the configuration system.",
  "frontend/src/icp-controls/types.ts": "Declares TypeScript types for control definitions, categories, options, and control metadata.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard composed of security, audit, terminal, deployment, and management panels with live audit logs.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Displays an operations dashboard that adapts terminal commands and UI panels based on ICP or Web Controller role.",
  "frontend/src/queryKeys.ts": "Provides shared React Query key generators for controller statuses, principals, and related lists.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the terminal command registry composed of core commands.",
  "frontend/src/terminal/coreCommands.ts": "Defines core terminal commands including help, clear, and security role-management with audit logging and query invalidation.",
  "frontend/src/terminal/icpControllerCommands.ts": "Implements a restricted command set for ICP Controllers including help, clear, and profile management commands.",
  "frontend/src/terminal/terminalGuards.ts": "Provides audit helpers, error classification, auth checks, and utilities for timestamps and enum parsing.",
  "frontend/src/terminal/types.ts": "Defines TypeScript interfaces for terminal commands, context, outputs, and history entries.",
  "frontend/src/terminal/webControlAudit.ts": "Wraps Web Control terminal commands with best‑effort audit logging and shared error handling utilities.",
  "frontend/src/terminal/webControlCommandCatalog.ts": "Generates large sets of read‑only diagnostic and operations command metadata for the Web Control terminal.",
  "frontend/src/terminal/worldWideWebControllerCommands.ts": "Defines core terminal commands like help, clear, and status, integrating with the Web Control command catalog and audit system.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages file content persistence for the in-browser code editor using localStorage, including saving, applying, and resetting changes.",
  "frontend/src/utils/icpControls.ts": "Provides helpers for determining ICP network defaults, validating canister IDs, and deriving labels and host URLs.",
  "frontend/src/utils/icpControlsImportExport.ts": "Handles exporting, downloading, importing, validating, and reading ICP Controls configuration JSON files.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and cleaning them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color variables, extended styles, and typography/container/animation plugins.",
  "project_state.json": "JSON document describing the project’s state, planned features, architectural notes, issues, and existing feature metadata for a security‑enhanced ICP‑integrated app."
}