{
  "backend/main.mo": "Defines audit log types, access control state, user and controller records, and exposes initialization and role/query methods for the backend canister.",
  "feature_evidence.json": "Lists feature evidence entries describing role‑copy updates, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend components, hooks, panels, and styles used across the application.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing OKLCH color system for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that loads the React application from main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, role checks, view switching, profile setup, and routing to dashboards or access‑denied screen.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when access is denied, offering login, unsupported‑role warnings, principal copy, and ICP panels for authenticated users.",
  "frontend/src/components/AuditLogDetailDialog.tsx": "Displays detailed audit log information with formatted timestamps, severity indicators, and descriptions of action types.",
  "frontend/src/components/AuthStatusPanel.tsx": "Shows user authentication status, principal ID, and backend connectivity warnings with options to copy the principal and retry health checks.",
  "frontend/src/components/BroadcastConfigPanel.tsx": "Allows configuring external broadcasting settings, including enabling alerts and setting an endpoint URL with validation and mutation support.",
  "frontend/src/components/CodeEditorPanel.tsx": "Provides a file-based code editor with category switching, unsaved change prompts, apply/reset actions, and persistence via storage utilities.",
  "frontend/src/components/DashboardViewSwitcher.tsx": "Renders buttons to switch between security and ICP operations dashboards when permitted.",
  "frontend/src/components/DeploymentPanel.tsx": "Presents Caffeine platform deployment steps and links, including guidance and informational alerts.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying © notice and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Provides the main app header with authentication controls, theme toggle, role-based title, and optional dashboard view switching.",
  "frontend/src/components/IcpConnectionPanel.tsx": "Displays ICP network, canister, and connection status with automatic checks, error alerts, and retry support.",
  "frontend/src/components/IcpControllerManagementPanel.tsx": "Manages granting and revoking ICP Controller roles, including input forms, confirmation dialogs, and controller list display.",
  "frontend/src/components/IcpControlsCatalog.tsx": "Renders a searchable, categorized catalog of ICP control settings with support for editing, reset, import, and export.",
  "frontend/src/components/IcpControlsCatalogRow.tsx": "Renders an individual ICP control input row with dynamic input types based on the control definition.",
  "frontend/src/components/IcpControlsPanel.tsx": "Provides a wrapper panel introducing ICP controls and linking to the full controls catalog.",
  "frontend/src/components/IcpMainnetDeploymentPanel.tsx": "UI panel explaining prerequisites and step‑by‑step instructions for deploying canisters to the ICP mainnet. Provides alerts, badges, and command snippets for users.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a user's name and saves it via a mutation. Includes validation, loading state, and form submission handling.",
  "frontend/src/components/RealTimeAlertPanel.tsx": "Displays recent security alerts and flagged users in real time using logs and query data. Highlights critical or warning events from the last five minutes.",
  "frontend/src/components/RolesAccessPanel.tsx": "Shows caller and App Controller principals, handles initialization, and provides copy and status actions. Includes loading, error, and role‑based UI states.",
  "frontend/src/components/RootTerminalPanel.tsx": "Implements an interactive command terminal with history, command execution, and audit logging. Supports privilege checks and custom command registries.",
  "frontend/src/components/SecuritySummaryPanel.tsx": "Computes 24‑hour and 7‑day security metrics and displays summaries such as critical events, failed logins, and unauthorized attempts. Shows alerts for abnormal activity spikes.",
  "frontend/src/components/SuperuserAuditPanel.tsx": "Provides a superuser interface to export audit logs, export flagged users, and record audit actions with status handling and toast notifications.",
  "frontend/src/components/TestActionsPanel.tsx": "UI for generating and submitting test audit events with selectable action types, severity, and optional metadata.",
  "frontend/src/components/UserManagementPanel.tsx": "Manages user flagging, unflagging, and removal while displaying the list of flagged users with related actions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackendHealthCheck.ts": "Runs a lightweight backend connectivity check using the actor and returns connection status and errors.",
  "frontend/src/hooks/useDashboardView.ts": "Manages the selected dashboard view with session persistence and validation based on current access permissions.",
  "frontend/src/hooks/useIcpControls.ts": "Loads and manages ICP control settings from URL, session storage, or defaults with setters for network, canister ID, and additional controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication state and login flows using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, including profile, controller, and security status queries and mutations.",
  "frontend/src/icp-controls/bindings.ts": "Implements helpers for retrieving, parsing, serializing, and validating ICP control definitions and their stored values.",
  "frontend/src/icp-controls/registry.ts": "Contains the full registry of ICP configuration categories and control definitions for UI and system settings.",
  "frontend/src/icp-controls/types.ts": "Defines TypeScript types for control categories, control definitions, and related UI metadata.",
  "frontend/src/index.css": "Sets global Tailwind layers and CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements the admin dashboard UI with filters, audit logs, role panels, and various management components.",
  "frontend/src/pages/IcpOpsDashboard.tsx": "Renders the ICP operations console with connection panels, auth status, control catalog, and terminal access.",
  "frontend/src/queryKeys.ts": "Provides helper functions that generate consistent React Query keys for controller and security-related queries.",
  "frontend/src/terminal/commandRegistry.ts": "Exports the default terminal command registry composed of core commands.",
  "frontend/src/terminal/coreCommands.ts": "Defines core terminal commands including help, clear, and security role operations with backend and audit integration.",
  "frontend/src/terminal/icpControllerCommands.ts": "Implements a restricted command set for ICP Controller users, including help, clear, and profile management commands.",
  "frontend/src/terminal/terminalGuards.ts": "Contains utility guards for authentication, backend checks, audit recording, error classification, and timestamp/action parsing.",
  "frontend/src/terminal/types.ts": "Defines TypeScript interfaces for terminal commands, context, outputs, and history entries.",
  "frontend/src/utils/codeEditorStorage.ts": "Manages code editor state in localStorage, including loading, saving, applying changes, and tracking unsaved edits.",
  "frontend/src/utils/icpControls.ts": "Provides utilities for determining ICP network defaults, validating canister IDs, and mapping network labels and hosts.",
  "frontend/src/utils/icpControlsImportExport.ts": "Handles exporting, downloading, importing, and reading ICP Controls configuration JSON with validation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, planned architecture changes, known issues, and existing feature definitions for the app."
}