{
  "kind": "build_request",
  "title": "Repair UI visuals and dropdown menu behavior",
  "projectName": "Caffeine Console",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-90",
      "text": "Repair dropdown/select menus across the app so they reliably open, render above all panels (including the sticky header), and remain clickable (not visually clipped or hidden) in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Repair visuals and drop down menus"
        ]
      },
      "acceptanceCriteria": [
        "In the ICP Controls Catalog, any Select-based control opens a visible menu with options and selecting an option updates the control value.",
        "Dropdown menus are not clipped by surrounding containers (e.g., ScrollArea, Cards) and are not hidden behind the sticky header.",
        "Dropdown menus remain clickable and close appropriately (click outside or selection) without leaving the UI in a broken state.",
        "Behavior works in both light and dark themes."
      ]
    },
    {
      "id": "REQ-91",
      "text": "Audit and repair visual styling regressions affecting core dashboard layouts (header, cards, panels, spacing, typography) to ensure a consistent, readable UI in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Repair visuals and drop down menus"
        ]
      },
      "acceptanceCriteria": [
        "Header, cards, and panel content have consistent spacing and do not overlap at common viewport sizes (mobile and desktop).",
        "Text contrast meets basic readability expectations in both themes (no muted text appearing indistinguishable from background).",
        "No major UI elements appear visually broken (e.g., missing borders/backgrounds, unreadable gradients, misaligned controls)."
      ]
    },
    {
      "id": "REQ-92",
      "text": "Repair Network Map visual presentation so the canvas is clearly visible and the graph (nodes/edges/labels) is legible against the background in both light and dark themes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-6"
        ],
        "quotes": [
          "I can't see network map",
          "Repair visuals and drop down menus"
        ]
      },
      "acceptanceCriteria": [
        "The Network Map canvas area is visually distinct from the page background (clear boundary and adequate contrast).",
        "Nodes, edges, and labels are visible and readable in both themes (no 'white on white' / 'black on black' rendering).",
        "When the counters show Nodes: 1+, the user can visually locate at least one node on the canvas without requiring manual zoom/pan."
      ]
    },
    {
      "id": "REQ-93",
      "text": "Ensure tab-like navigation controls (e.g., the ICP Controls Catalog category tabs) remain visually consistent and usable, with clear active-state styling and no broken layout/overflow at common viewport sizes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Repair visuals and drop down menus"
        ]
      },
      "acceptanceCriteria": [
        "ICP Controls Catalog TabsList/TabsTrigger render without overlapping, and active category is clearly indicated.",
        "On smaller screens, tab controls remain usable (no off-screen-only active tab with no way to navigate)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources); fix dropdown/menu behavior by composition, styling overrides, or usage changes in app components.",
    "Do not edit immutable frontend paths listed by the platform (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx)."
  ],
  "nonGoals": [
    "Do not add new roles, permissions, or backend APIs as part of this task.",
    "Do not change the network graph data model or backend storage; focus only on frontend visuals and menu usability.",
    "Do not redesign product features; only repair and improve current UI behavior and presentation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}