{
  "kind": "build_request",
  "title": "Remove full-screen loading UI and disable automatic data polling/refresh",
  "projectName": "Caffeine Security Console",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-99",
      "text": "Remove the full-screen \"Loading...\" screen in frontend/src/App.tsx so the app never blocks the entire UI behind a global loading spinner while authentication/role/profile queries are in-flight.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove loading screen and automatic updates"
        ]
      },
      "acceptanceCriteria": [
        "On first load and after refresh, the app does not render a full-screen loading page with a centered spinner and the text \"Loading...\".",
        "The Header and overall page shell still render immediately, and any loading states are shown inline within the relevant panels/areas (not as a global takeover).",
        "Unauthenticated users can still reach the Access Denied experience without waiting on role queries to finish."
      ]
    },
    {
      "id": "REQ-100",
      "text": "Disable automatic updates/polling behavior in the frontend so data does not refresh on an interval or due to implicit React Query auto-refetch defaults; updates must occur only on explicit user action (e.g., button click) or after a user-initiated mutation invalidates queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Remove loading screen and automatic updates"
        ]
      },
      "acceptanceCriteria": [
        "The audit log query in frontend/src/hooks/useQueries.ts no longer auto-refreshes every 10 seconds (remove/refactor the current refetchInterval: 10000 behavior).",
        "React Query does not automatically refetch queries just because the window regains focus or reconnects (configure the QueryClient in frontend/src/main.tsx to disable these implicit refetches).",
        "A user can still manually refresh relevant live data (at minimum audit logs) via an explicit UI control, and the refresh visibly updates the displayed data when the backend is reachable."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts, or frontend/src/main.tsx outside of safe, necessary configuration changes (e.g., QueryClient default options)."
  ],
  "nonGoals": [
    "Do not change backend (Motoko) APIs or authorization rules.",
    "Do not add real-time features (WebSockets, push, etc.).",
    "Do not remove user-initiated refresh/retry buttons (e.g., existing connection retry actions); only remove automatic/background updates."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}