{
  "kind": "build_request",
  "title": "Make the ICP Controller (ICP Operations) page discoverable and accessible",
  "projectName": "Caffeine Console",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-55",
      "text": "Add an explicit, user-visible way to open the ICP Controller experience (the ICP Operations Console) so that users with the ICP Controller role can reliably find it instead of relying on implicit role-based rendering.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I don't see the icp controller page"
        ]
      },
      "acceptanceCriteria": [
        "When the authenticated user has the ICP Controller role, there is a clearly labeled navigation control (for example, a button or tab) with English text that opens the ICP Operations Console.",
        "If the authenticated user does not have the ICP Controller role, the ICP Operations navigation control is not shown (or is shown disabled with an English explanation)."
      ]
    },
    {
      "id": "REQ-56",
      "text": "Support users who have both Security/App Controller access and the ICP Controller role by allowing them to switch between the Security Dashboard (AdminDashboard) and the ICP Operations Console (IcpOpsDashboard) without changing roles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I don't see the icp controller page"
        ]
      },
      "acceptanceCriteria": [
        "If a user is both (App Controller or Security) AND ICP Controller, the UI provides a clear view switcher with English labels (e.g., \"Security Dashboard\" and \"ICP Operations\") that changes the main content between AdminDashboard and IcpOpsDashboard.",
        "Switching views does not log the user out and does not require a page reload.",
        "The currently selected view is visually indicated in the UI."
      ]
    },
    {
      "id": "REQ-57",
      "text": "Persist the selected view (Security Dashboard vs ICP Operations) on the client so that refresh/navigation during the session keeps the user on the last selected view, while still respecting role-based access rules.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I don't see the icp controller page"
        ]
      },
      "acceptanceCriteria": [
        "After selecting \"ICP Operations\" (or the equivalent), a page refresh keeps the user in the ICP Operations Console for the remainder of the session (unless access rules prevent it).",
        "If the user loses access to a view (e.g., logs out), the app falls back to the appropriate screen (Access Denied or the permitted dashboard) without errors.",
        "All user-facing persistence-related copy (if any) is in English."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the existing role-gating rules: Security Dashboard remains restricted to App Controller or Security users; ICP Operations remains available to ICP Controller users (including those who also have App Controller/Security)."
  ],
  "nonGoals": [
    "Do not add or change backend Motoko APIs or role definitions for this request.",
    "Do not add third-party routing frameworks (e.g., Next.js) or external authentication providers.",
    "Do not expose security/audit/admin panels (audit logs, user management, broadcasting config, security role management, ICP controller role management) inside the ICP Operations Console for ICP Controller-only users."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}