{
  "kind": "build_request",
  "title": "Repair ICP connection wiring so Network Graph loads reliably",
  "projectName": "ICP Ops Console",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-94",
      "text": "Fix backend actor creation so it is keyed by (and connects using) the effective ICP Controls target settings, ensuring the actor is re-created whenever the operator changes ICP network and/or canister ID settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It says failed to load network graph you must repair my icp connection"
        ]
      },
      "acceptanceCriteria": [
        "When the user changes ICP Controls values that affect the target (at minimum: network and canisterId), subsequent backend calls use the new target without requiring a page refresh.",
        "The backend actor query key includes the effective target settings (at minimum: network and canisterId) so React Query does not reuse an actor created for a different target.",
        "The app does not silently keep using a stale actor after ICP Controls changes."
      ]
    },
    {
      "id": "REQ-95",
      "text": "Make Network Graph React Query caching target-aware so a failed load (or successful load) for one ICP target does not incorrectly persist when switching to a different target.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "failed to load network graph"
        ]
      },
      "acceptanceCriteria": [
        "The network graph query key is scoped to the effective ICP target (at minimum: network and canisterId).",
        "Switching ICP Controls to a new target triggers a fresh network graph fetch (no stale cached error from the previous target).",
        "Returning to a previous target reuses the correct cached graph for that target (if available) rather than mixing targets."
      ]
    },
    {
      "id": "REQ-96",
      "text": "Improve the Network Map load-failure UX so that when the network graph cannot be fetched due to ICP connectivity/target issues, the UI clearly explains that the canister target is unreachable, shows the effective network + canister ID, and provides a one-click retry that re-runs the fetch after the actor/connection is re-established.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "It says failed to load network graph you must repair my icp connection"
        ]
      },
      "acceptanceCriteria": [
        "On network graph load error, the Network Map panel shows an English error message that distinguishes \"backend not reachable / wrong target\" from other errors when possible (e.g., when the actor is unavailable).",
        "The error UI displays the effective network label and the effective canister ID that the app is currently configured to use.",
        "A visible \"Retry\" action is provided and successfully re-attempts loading the network graph.",
        "User-facing text remains in English."
      ]
    },
    {
      "id": "REQ-97",
      "text": "Prevent network graph fetching when the effective canister ID is not a valid principal text (or is a placeholder value), and instead present an English guidance message prompting the user to set a valid canister ID in ICP Controls before retrying.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "failed to load network graph"
        ]
      },
      "acceptanceCriteria": [
        "If the effective canister ID is missing/invalid, the network graph query does not run and does not show a misleading backend error.",
        "The Network Map panel shows a clear English message indicating the canister ID is not configured/invalid and instructs the user to update it in ICP Controls.",
        "After entering a valid canister ID, the network graph query becomes enabled and loads normally (without requiring refresh)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Do not add new roles/permissions or change authorization rules as part of this fix.",
    "Do not redesign the Network Map feature set (only repair connectivity/targeting and related error handling).",
    "Do not add external databases, third-party auth providers, or non-IC hosting/deployment mechanisms."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}