{
  "kind": "build_request",
  "title": "Add Web Control (World Wide Web Controller) operator controls",
  "projectName": "ICP Ops Console",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-76",
      "text": "Update the ICP Operations Console (frontend/src/pages/IcpOpsDashboard.tsx) to provide a distinct Web Control experience when the authenticated user has the World Wide Web Controller role (\"Web Control\"), including selecting a Web Control-specific terminal command registry instead of always using the ICP Controller command registry.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Web controller controls"
        ]
      },
      "acceptanceCriteria": [
        "When a user has World Wide Web Controller role (and not ICP Controller role), the ICP Operations Console renders and uses a Web Control-specific command registry for the terminal.",
        "When a user has ICP Controller role, the ICP Operations Console continues to use the existing ICP Controller command registry.",
        "User-facing text on this page remains English-only."
      ]
    },
    {
      "id": "REQ-77",
      "text": "Create a new Web Control-safe terminal command registry (new file under frontend/src/terminal/, e.g. frontend/src/terminal/worldWideWebControllerCommands.ts) and wire it into IcpOpsDashboard for World Wide Web Controller users. The command set must be safe (no security/audit/role-admin/user-management/broadcast-config commands) and must include at minimum: help, clear, and a role self-check command that reports World Wide Web Controller role status using a real backend canister call.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Web controller controls"
        ]
      },
      "acceptanceCriteria": [
        "A new command registry exists for World Wide Web Controller users and is used by the ICP Operations Terminal when the user is a Web Controller.",
        "The registry includes: help, clear, and a \"web-controller-status\" (or equivalent) command that calls the backend to check the caller’s World Wide Web Controller status and prints an English result.",
        "Web Control terminal commands do not expose Security Dashboard-only capabilities (audit logs, user management, broadcasting config, Security role admin, ICP Controller admin, or World Wide Web Controller admin)."
      ]
    },
    {
      "id": "REQ-78",
      "text": "Ensure every Web Control terminal command attempts best-effort audit recording using the existing terminal guard/audit helper patterns, and that audit-recording failures never cause the command itself to fail (mirror the reliability behavior expected of the Root Terminal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add Web controller controls"
        ]
      },
      "acceptanceCriteria": [
        "Each Web Control terminal command execution attempts audit recording where applicable.",
        "If audit logging is unavailable (not authenticated, actor not available, or recording fails), the command still returns its primary output and includes a clear English warning if needed."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend changes if strictly necessary for the Web Control UI/terminal behavior.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add or expose Security Dashboard features (audit logs, user management, broadcasting configuration, superuser actions, or role administration) to World Wide Web Controller users.",
    "Do not implement any new third-party authentication or external database/storage.",
    "Do not change deployment flows or add new deployment automation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}