{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Web Control (World Wide Web Controller) operator controls",
  "requirements": [
    {
      "id": "REQ-76",
      "summary": "Render a distinct Web Control experience in IcpOpsDashboard by selecting a Web Control-specific terminal command registry for World Wide Web Controller users.",
      "acceptanceCriteria": [
        "When a user has World Wide Web Controller role (and not ICP Controller role), the ICP Operations Console renders and uses a Web Control-specific command registry for the terminal.",
        "When a user has ICP Controller role, the ICP Operations Console continues to use the existing ICP Controller command registry.",
        "User-facing text on this page remains English-only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/IcpOpsDashboard.tsx",
          "operation": "modify",
          "description": "Update role-based terminal behavior to choose between the existing icpControllerCommandRegistry and a new worldWideWebControllerCommandRegistry (ICP Controller takes precedence if both roles are present). Adjust terminal title/description strings to be Web Control-specific when applicable, while keeping all user-facing text English-only. Use the existing RBAC/role-check patterns provided by the authorization component (via existing role status hooks) to drive this UI behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-77",
      "summary": "Add a Web Control-safe terminal command registry with minimal safe commands (help, clear, web-controller-status) and wire it into IcpOpsDashboard for World Wide Web Controller users.",
      "acceptanceCriteria": [
        "A new command registry exists for World Wide Web Controller users and is used by the ICP Operations Terminal when the user is a Web Controller.",
        "The registry includes: help, clear, and a \"web-controller-status\" (or equivalent) command that calls the backend to check the caller’s World Wide Web Controller status and prints an English result.",
        "Web Control terminal commands do not expose Security Dashboard-only capabilities (audit logs, user management, broadcasting config, Security role admin, ICP Controller admin, or World Wide Web Controller admin)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/terminal/worldWideWebControllerCommands.ts",
          "operation": "create",
          "description": "Create a new World Wide Web Controller-safe command registry exporting a TerminalCommand[] containing ONLY safe commands: help, clear, and a role self-check command (e.g., web-controller-status) that uses a real backend canister call available on the actor (hasWorldWideWebControllerRole) and prints an English-only result. Ensure the help output lists only commands in this registry, and ensure no security/audit dashboard-only, role-admin, user-management, or broadcast-config commands are present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/IcpOpsDashboard.tsx",
          "operation": "modify",
          "description": "Import the new worldWideWebControllerCommandRegistry and wire it into RootTerminalPanel for World Wide Web Controller users (who are not ICP Controllers). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-78",
      "summary": "Ensure all Web Control terminal commands use best-effort audit recording patterns and never fail due to audit-recording issues.",
      "acceptanceCriteria": [
        "Each Web Control terminal command execution attempts audit recording where applicable.",
        "If audit logging is unavailable (not authenticated, actor not available, or recording fails), the command still returns its primary output and includes a clear English warning if needed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/terminal/worldWideWebControllerCommands.ts",
          "operation": "modify",
          "description": "Implement each command to follow existing terminal guard/audit helper patterns by using tryRecordAuditEntry and appendAuditWarning for best-effort audit recording. Ensure audit-recording failures are caught and reflected as an English warning appended to the command output, and never prevent the command’s primary output from being returned. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/terminal/terminalGuards.ts",
          "operation": "modify",
          "description": "If needed for consistency, add/adjust a small shared helper that simplifies producing a standard English audit warning output for Web Control commands without changing the reliability behavior (audit failures must never throw). Keep behavior aligned with tryRecordAuditEntry + appendAuditWarning patterns. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}