{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Caffeine Console — UI visual repairs (dropdowns, layouts, tabs, network map)",
  "requirements": [
    {
      "id": "REQ-90",
      "summary": "Fix Select/dropdown menus to open reliably, overlay above sticky header/panels, avoid clipping, and remain clickable in light/dark themes.",
      "acceptanceCriteria": [
        "In the ICP Controls Catalog, any Select-based control opens a visible menu with options and selecting an option updates the control value.",
        "Dropdown menus are not clipped by surrounding containers (e.g., ScrollArea, Cards) and are not hidden behind the sticky header.",
        "Dropdown menus remain clickable and close appropriately (click outside or selection) without leaving the UI in a broken state.",
        "Behavior works in both light and dark themes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS overrides (outside shadcn sources) to ensure Radix/shadcn Select dropdown portals/poppers render with a z-index above the sticky header and panels, and to prevent pointer-event/clickability issues and visual clipping artifacts in both themes."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Adjust header stacking context/z-index and any styles that may create unintended stacking contexts (e.g., backdrop/positioning) so dropdown popovers can reliably overlay the sticky header while remaining clickable."
        },
        {
          "path": "frontend/src/components/IcpControlsCatalogRow.tsx",
          "operation": "modify",
          "description": "Update Select composition/props at the usage site (without editing frontend/src/components/ui) to ensure SelectContent is portaled/positioned correctly and receives an explicit high z-index class so the menu is never hidden/clipped inside ScrollArea/Cards. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/IcpControlsCatalog.tsx",
          "operation": "modify",
          "description": "Audit and adjust ScrollArea/Tabs layout composition around rows so Select triggers and the dropdown menu interaction are not hindered by container overflow settings; ensure catalog interactions remain stable after dropdown selection/close. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-91",
      "summary": "Audit and repair core dashboard visual regressions (header, cards, panels, spacing, typography) for consistent readability in light/dark themes.",
      "acceptanceCriteria": [
        "Header, cards, and panel content have consistent spacing and do not overlap at common viewport sizes (mobile and desktop).",
        "Text contrast meets basic readability expectations in both themes (no muted text appearing indistinguishable from background).",
        "No major UI elements appear visually broken (e.g., missing borders/backgrounds, unreadable gradients, misaligned controls)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Tune theme tokens and add small global style safeguards (e.g., muted text contrast, popover/card readability, focus/outline visibility) to eliminate light/dark regressions without modifying shadcn UI source files."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Improve header layout responsiveness (spacing/wrapping/alignment) so controls and text do not overlap on mobile and common desktop widths while preserving existing behavior."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Adjust dashboard container spacing/grid behavior for mobile/desktop to reduce crowding and prevent panel overlap while keeping the same set/order of panels."
        },
        {
          "path": "frontend/src/pages/IcpOpsDashboard.tsx",
          "operation": "modify",
          "description": "Adjust dashboard container spacing/grid behavior for mobile/desktop to ensure consistent layout, readable typography, and no panel overlap across themes."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Fix Network Map canvas visibility and ensure nodes/edges/labels are legible with correct contrast in light/dark themes.",
      "acceptanceCriteria": [
        "The Network Map canvas area is visually distinct from the page background (clear boundary and adequate contrast).",
        "Nodes, edges, and labels are visible and readable in both themes (no 'white on white' / 'black on black' rendering).",
        "When the counters show Nodes: 1+, the user can visually locate at least one node on the canvas without requiring manual zoom/pan."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NetworkMapCanvas.tsx",
          "operation": "modify",
          "description": "Make canvas rendering theme-aware by deriving node/edge/label colors from CSS theme variables (light/dark), improve background/border contrast, and adjust label drawing to avoid low-contrast text; add a safe initial auto-center/fit behavior when nodes exist so at least one node is visible without manual pan/zoom."
        },
        {
          "path": "frontend/src/components/NetworkMapPanel.tsx",
          "operation": "modify",
          "description": "Ensure the Network Map card/panel presentation clearly frames the canvas area (consistent padding/border/contrast) in both themes and does not visually blend into surrounding background."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust any needed theme tokens/utility styles to support readable canvas overlays (e.g., hint badge background/foreground contrast) and consistent light/dark rendering."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Repair tab-like navigation controls (ICP Controls Catalog category tabs) to keep active-state clear and prevent overflow/broken layouts on common viewport sizes.",
      "acceptanceCriteria": [
        "ICP Controls Catalog TabsList/TabsTrigger render without overlapping, and active category is clearly indicated.",
        "On smaller screens, tab controls remain usable (no off-screen-only active tab with no way to navigate)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IcpControlsCatalog.tsx",
          "operation": "modify",
          "description": "Refactor the TabsList/TabsTrigger layout at the usage site to avoid grid overflow (e.g., use a horizontally scrollable tabs row with non-wrapping triggers and clear active-state styling) while keeping existing categories and content mapping. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal CSS overrides (non-ui-source) if necessary to ensure Tabs active/hover/focus states are readable and consistent in both themes, especially when tabs are scrollable."
        }
      ]
    }
  ]
}