{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make ICP Operations Console discoverable with role-aware view switching and session persistence",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Expose an explicit, role-gated navigation control to open the ICP Operations Console for ICP Controller users",
      "acceptanceCriteria": [
        "When the authenticated user has the ICP Controller role, there is a clearly labeled navigation control (for example, a button or tab) with English text that opens the ICP Operations Console.",
        "If the authenticated user does not have the ICP Controller role, the ICP Operations navigation control is not shown (or is shown disabled with an English explanation)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DashboardViewSwitcher.tsx",
          "operation": "create",
          "description": "Create a small, reusable view switcher control composed from existing shadcn/ui components (do not modify anything under frontend/src/components/ui) that can show an \"ICP Operations\" navigation control only when allowed by roles, and can optionally render disabled state with an English explanation when not allowed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Integrate the explicit \"ICP Operations\" navigation control into the header (using the new DashboardViewSwitcher) and ensure it is only shown when the authenticated user has ICP Controller access; do not show it for users without that role (or render disabled with an English explanation if chosen). Also ensure the header title/affordances can reflect the currently selected view. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new explicit navigation control by lifting selected dashboard view state into App and passing selectedView + onSelectView into Header so users can open ICP Operations without relying on implicit role-based rendering. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Allow users with both Security/App Controller access and ICP Controller role to switch between Security Dashboard and ICP Operations without reload/logout",
      "acceptanceCriteria": [
        "If a user is both (App Controller or Security) AND ICP Controller, the UI provides a clear view switcher with English labels (e.g., \"Security Dashboard\" and \"ICP Operations\") that changes the main content between AdminDashboard and IcpOpsDashboard.",
        "Switching views does not log the user out and does not require a page reload.",
        "The currently selected view is visually indicated in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DashboardViewSwitcher.tsx",
          "operation": "modify",
          "description": "Extend the switcher to support two labeled options (\"Security Dashboard\" and \"ICP Operations\") when both views are permitted, visually indicate the currently selected view, and call back to the parent to switch main content without reload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Render the view switcher in a prominent, user-visible location in the header when the user has both Security/App Controller access and ICP Controller role; keep the rest of the header (auth, theme toggle) intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update App rendering logic so that when the user has both permitted views, switching the selected view changes the main content between AdminDashboard and IcpOpsDashboard without logging out and without a full page reload, while keeping the existing role-gating rules. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Persist the selected dashboard view for the session and fall back safely when access changes",
      "acceptanceCriteria": [
        "After selecting \"ICP Operations\" (or the equivalent), a page refresh keeps the user in the ICP Operations Console for the remainder of the session (unless access rules prevent it).",
        "If the user loses access to a view (e.g., logs out), the app falls back to the appropriate screen (Access Denied or the permitted dashboard) without errors.",
        "All user-facing persistence-related copy (if any) is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDashboardView.ts",
          "operation": "create",
          "description": "Create a hook that manages the selected view with session-scoped persistence (use sessionStorage via existing helpers in frontend/src/utils/urlParams.ts), validates the persisted selection against the currently allowed views, and provides a safe fallback to an allowed view when roles/access change. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adopt the new useDashboardView hook to initialize selected view from session storage, keep it in sync when roles change, clear persisted selection on logout, and ensure the app falls back to AccessDeniedScreen or the permitted dashboard without errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Consume selectedView (from App) to keep header labeling consistent with the persisted/active view; ensure any persistence-related copy remains English (or omit copy entirely). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}