{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Clarify unsupported 'Web control' role requests with in-app guidance",
  "requirements": [
    {
      "id": "REQ-64",
      "summary": "Clarify in Roles & Access panel that 'Web control' / 'World Wide Web Controller' is not supported and guide users to supported roles and next steps.",
      "acceptanceCriteria": [
        "Roles & Access panel text explicitly mentions that \"Web control\" / \"World Wide Web Controller\" is not a supported role name in this app.",
        "The UI clearly states (in English) that only these roles exist: App Controller, Security, ICP Controller.",
        "The UI provides a clear next step: instruct the user to share their Principal ID with the App Controller to request either the Security role (for security/audit features) or the ICP Controller role (for ICP operations)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RolesAccessPanel.tsx",
          "operation": "modify",
          "description": "Update the \"Supported Roles\" section copy to explicitly call out that \"Web control\" / \"World Wide Web Controller\" is not a supported role in this application; explicitly list App Controller, Security, and ICP Controller as the only roles; and add clear next-step guidance to share the user's Principal ID with the App Controller to request Security (security/audit) or ICP Controller (ICP operations). Use the authorization component's role-based access guidance patterns (copy/UX only). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-65",
      "summary": "Update Access Denied screen guidance for authenticated-but-unauthorized users to explicitly note 'Web control' is not supported and direct them to request Security or ICP Controller access.",
      "acceptanceCriteria": [
        "When an authenticated user sees Access Denied, the page includes a sentence stating that \"Web control\" is not a supported role in this application.",
        "The page continues to show the user’s Principal ID and one-click copy, and the guidance text recommends requesting Security or ICP Controller from the App Controller."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Adjust authenticated Access Denied copy to: (1) explicitly state that \"Web control\" / \"World Wide Web Controller\" access cannot be granted because it is not a supported role in this app; (2) recommend requesting Security or ICP Controller access from the App Controller; and (3) keep the Principal ID display and one-click copy behavior intact. Align messaging with the authorization component's AccessDeniedScreen guidance approach (copy/UX only). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}