{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Web Control: Data-Driven Safe Command Catalog + Quick Tools",
  "requirements": [
    {
      "id": "REQ-79",
      "summary": "Expand Web Control commands with safe diagnostics, frontend operational tools, and self-service principal/role helpers (no admin/security capabilities).",
      "acceptanceCriteria": [
        "When a user has the World Wide Web Controller role, the ICP Operations Console uses the Web Control terminal registry (frontend/src/terminal/worldWideWebControllerCommands.ts) and exposes the new command categories for diagnostics, operational tools, and self-service helpers.",
        "All new Web Control commands are limited to safe read-only diagnostics and user self-service actions, and do not provide any ability to manage roles, access audit logs, manage users, or edit broadcasting configuration.",
        "All user-facing command descriptions, usage strings, and outputs are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/terminal/webControlCommandCatalog.ts",
          "operation": "create",
          "description": "Create a data-driven catalog that defines safe Web Control command metadata and generators for: (1) read-only ICP diagnostics (client-side/environment/connectivity summaries), (2) frontend-side operational tools (local config/export/import/reset helpers), and (3) self-service helpers (principal display/copy guidance and role confirmation helpers). Ensure the catalog explicitly excludes any security/audit/user-management/role-admin/broadcasting-config capabilities and keeps all text in English."
        },
        {
          "path": "frontend/src/terminal/worldWideWebControllerCommands.ts",
          "operation": "modify",
          "description": "Replace the static Web Control registry with catalog-driven command generation and updated category grouping for diagnostics/operational tools/self-service. Keep commands safe/read-only and ensure English descriptions/usage/output. Ensure the exported registry remains the single source for Web Control terminal usage in the ICP Operations Console."
        }
      ]
    },
    {
      "id": "REQ-80",
      "summary": "Scale Web Control to 200+ safe commands via a data-driven command catalog while keeping help responsive and readable.",
      "acceptanceCriteria": [
        "The Web Control terminal registry provides at least 200 distinct command names discoverable via \"help\" output for World Wide Web Controller users.",
        "The \"help\" command remains responsive and readable with the expanded command set (grouped by category similar to the existing help behavior in frontend/src/terminal/worldWideWebControllerCommands.ts).",
        "Each generated command has an English name, description, and (when applicable) usage string."
      ],
      "file_operations": [
        {
          "path": "frontend/src/terminal/webControlCommandCatalog.ts",
          "operation": "modify",
          "description": "Implement command catalog generation to produce at least 200 distinct, safe command names across categories (including structured naming for large sets). Provide enough metadata (name/description/usage/category) for readable help output without runtime-heavy computation."
        },
        {
          "path": "frontend/src/terminal/worldWideWebControllerCommands.ts",
          "operation": "modify",
          "description": "Enhance Web Control help behavior to stay readable with hundreds of commands: group by category and support targeted help (e.g., help <command>, and a category/search-focused mode) so help output remains responsive and not excessively long. Keep all help text in English."
        }
      ]
    },
    {
      "id": "REQ-81",
      "summary": "Ensure every Web Control command uses best-effort audit recording and never fails solely due to audit unavailability.",
      "acceptanceCriteria": [
        "For every Web Control command that executes, the implementation attempts to record an audit entry using the existing helper pattern (e.g., tryRecordAuditEntry / appendAuditWarning) and continues even if audit recording fails.",
        "If audit recording fails, the command output remains successful (when the underlying command succeeded) and includes a non-blocking English warning message consistent with the existing appendAuditWarning behavior.",
        "No Web Control command throws an unhandled exception that breaks terminal execution flow; errors are surfaced as English terminal output using the existing error classification approach."
      ],
      "file_operations": [
        {
          "path": "frontend/src/terminal/webControlAudit.ts",
          "operation": "create",
          "description": "Add a small helper to standardize Web Control command execution: wrap command logic with try/catch, classifyError usage, and best-effort audit recording via tryRecordAuditEntry + appendAuditWarning (non-blocking). This should be reusable by all generated commands, including local-only commands like help/clear."
        },
        {
          "path": "frontend/src/terminal/worldWideWebControllerCommands.ts",
          "operation": "modify",
          "description": "Refactor all existing and newly generated Web Control commands to use the shared best-effort audit wrapper pattern so every command attempts audit recording and never throws unhandled exceptions. Ensure warnings and error outputs remain English and consistent with appendAuditWarning/classifyError."
        }
      ]
    },
    {
      "id": "REQ-82",
      "summary": "Add a Web Control “Quick Tools” section in ICP Operations Console for safe frontend-side actions only.",
      "acceptanceCriteria": [
        "When the authenticated user has the World Wide Web Controller role, the ICP Operations Console displays a clearly labeled Web Control “Quick Tools” section with safe actions that operate on client-side configuration and diagnostics only.",
        "The quick tools do not render any UI that performs security/audit/admin actions (no audit log export, no user management, no role management, no broadcasting configuration).",
        "All user-facing labels and helper text in the Web Control quick tools section are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WebControlQuickToolsPanel.tsx",
          "operation": "create",
          "description": "Create a Web Control-focused Quick Tools panel for World Wide Web Controller users containing only safe frontend-side actions: copy principal (if available), export ICP Controls settings JSON, import ICP Controls settings JSON, reset ICP Controls to defaults, and refresh/retry connection checks. Ensure no Security Dashboard-only functionality is present and all labels/help text are in English."
        },
        {
          "path": "frontend/src/pages/IcpOpsDashboard.tsx",
          "operation": "modify",
          "description": "Wire the new Web Control Quick Tools panel into the ICP Operations Console UI so it renders only for World Wide Web Controller users (and does not appear for users without the role). Keep existing role precedence behavior intact and avoid introducing any admin/security-only panels into the Web Control view."
        }
      ]
    }
  ]
}