{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove global loading takeover and disable automatic React Query polling/refresh",
  "requirements": [
    {
      "id": "REQ-99",
      "summary": "Remove the full-screen global Loading UI and render the app shell immediately while auth/role/profile queries load inline",
      "acceptanceCriteria": [
        "On first load and after refresh, the app does not render a full-screen loading page with a centered spinner and the text \"Loading...\".",
        "The Header and overall page shell still render immediately, and any loading states are shown inline within the relevant panels/areas (not as a global takeover).",
        "Unauthenticated users can still reach the Access Denied experience without waiting on role queries to finish."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the early-return full-screen loading takeover; keep Header/Footer always rendered. Adjust main content selection to (1) show AccessDeniedScreen immediately when unauthenticated, (2) show a non-blocking inline \"checking access\"/skeleton state while authenticated role/profile queries are still loading, and (3) only decide between ProfileSetupModal / dashboards / AccessDenied once role checks are resolved."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Prevent unauthenticated users from being blocked by profile fetching: gate useGetCallerUserProfile with identity-aware enabled logic so it does not run for guests/anonymous, and ensure returned isLoading/isFetched semantics still support avoiding profile-setup modal flash."
        }
      ]
    },
    {
      "id": "REQ-100",
      "summary": "Disable automatic polling and implicit React Query refetch; provide explicit manual refresh for audit logs",
      "acceptanceCriteria": [
        "The audit log query in frontend/src/hooks/useQueries.ts no longer auto-refreshes every 10 seconds (remove/refactor the current refetchInterval: 10000 behavior).",
        "React Query does not automatically refetch queries just because the window regains focus or reconnects (configure the QueryClient in frontend/src/main.tsx to disable these implicit refetches).",
        "A user can still manually refresh relevant live data (at minimum audit logs) via an explicit UI control, and the refresh visibly updates the displayed data when the backend is reachable."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove the audit log automatic polling by deleting refetchInterval from useGetAuditLogs (and ensure no other interval-based refresh is introduced). Keep query invalidation-driven refresh behavior for user-initiated mutations."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Update QueryClient construction with safe, necessary defaultOptions to disable implicit refetches (e.g., refetchOnWindowFocus and refetchOnReconnect; optionally refetchOnMount) while preserving explicit refetch() and invalidateQueries behavior."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add an explicit \"Refresh\" control for audit logs using the existing audit logs query's refetch() (and show a visible fetching state). Wire the query object (not just data) so the button reliably refreshes the displayed logs."
        }
      ]
    }
  ]
}