{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-18T00:10:42.685Z",
  "summary": "Implemented a new target-aware backend actor hook and updated React Query keys for the actor and network graph to include ICP target settings (network + canisterId). Network graph fetching is gated on canisterId validity via validation utilities and React Query `enabled`. However, the diff evidence is insufficient to confirm the required Network Map error-state UX (effective target display + retry) is fully implemented.",
  "missing_requirements": [
    {
      "id": "REQ-96",
      "requirement": "Improve the Network Map load-failure UX so that when the network graph cannot be fetched due to ICP connectivity/target issues, the UI clearly explains that the canister target is unreachable, shows the effective network + canister ID, and provides a one-click retry that re-runs the fetch after the actor/connection is re-established.",
      "reason": "While `NetworkMapPanel` adds a `handleRetry` function and imports utilities like `getNetworkLabel`, the provided diff snippet is truncated before showing any concrete error UI that (a) displays the effective network label and canister ID, and (b) distinguishes target/connectivity errors from other errors. The acceptance-criteria UI elements are not verifiable from the diff summary evidence.",
      "evidence": [
        "frontend/src/components/NetworkMapPanel.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added a backend connectivity/health-check React Query hook (`useBackendHealthCheck`).",
      "reason": "Not requested by REQ-94 through REQ-97; the BuildRequest focuses on actor recreation, target-aware caching, and Network Map error/validation UX, not a separate health-check hook.",
      "evidence": [
        "frontend/src/hooks/useBackendHealthCheck.ts"
      ]
    }
  ],
  "confidence": 0.63,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/components/NetworkMapPanel.tsx",
    "frontend/src/hooks/useBackendHealthCheck.ts",
    "frontend/src/hooks/useNetworkGraph.ts",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/hooks/useTargetActor.ts",
    "frontend/src/queryKeys.ts",
    "frontend/src/utils/icpControls.ts",
    "project_state.json"
  ]
}